#include <stdio.h>
int main(int argc, char **argv)
{
	system("chcp 1253");
	int n, i, x; 
	int sum, gin,pl_art,tetr, pl_th, pl_arn; 
	float avg;/*μέσος όρος*/
	pl_art=0;/*πλήθος άρτιων*/
	pl_th=0;/*πλήθος θετικών*/
	pl_arn=0;/*πλήθος αρνητικών*/
	sum=0;/*άθροισμα*/ 
	gin=1;/*γινόμενο*/
	
	printf("Εισάγετε το πλήθος των αριθμών: \n");
	scanf("%d", &n);
		
for (i=1; i<=n; i++)
	{
		printf("\n-Δώσε τον %dο αριθμό:", i);
			scanf("%d", &x);
			
				if (x<0)/*αν δοθεί αρνητικός αριθμός*/
				{
						if(x%2==0)
						pl_art+=1;/*μέτρηση άρτιων αριθμών*/
						if (x%2!=0)
							printf("Το τετράγωνο του %d είναι: %d\n",x,x*x);/*τετράγωνο αρνητικού περιττού αριθμού*/
						gin*=x;	/*γινόμενο=γινόμενο*x */
						pl_arn+=1;/*πλήθος αρνητικών*/			
				}
			if (x>=0)
			{
				pl_th=pl_th+1;/*πλήθος θετικών αριθμών*/
				sum+=x;/*άθροισμα θετικών*/
				avg=(float)sum/pl_th;/*μέσος όρος=άθροισμα/πλήθος*/
					if(x%2==0)
						pl_art+=1;/*μέτρηση άρτιων αριθμών*/
				 			if (x%2==1)
				 				printf("Το τετράγωνο του %d είναι: %d\n",x,x*x);
			}						
}
	if(pl_arn!=0)/*εάν το πλήθος των αρνητικών είναι διάφορο του 0, δηλαδή έχει βρεθεί τουλάχιστον 1 αρνητικός*/
		printf("\n\tΤο γινόμενο των αρνητικών αριθμών είναι: %d\n",gin);
		if (pl_arn==0)/*εάν το πλήθος των αρνητικών είναι 0, δεν έχει βρεθεί ούτε ένας */
			printf("\n\tΔεν δόθηκε κανένας αρνητικός αριθμός\n");
			if (pl_th!=0 && pl_th>1)/*αν το πλήθος των θετικών είναι διάφορο του 0, έχει βρεθεί τουλάχιστον 1 θετικός, */
												/*άρα μπορώ να υπολογίσω τον μέσο όρο και το πλήθος των θετικών >1*/
												/*άρα υπολογίζω το άθροισμα μεταξύ δύο και παραπάνω αριθμών*/
				{
					printf("\n\tΤο άθροισμα των θετικών αριθμών είναι: %d\n", sum);
					if(x!=0 && pl_th>1)/*Αν το πλήθος των θετικών είναι >1(έχουν βρεθεί 2 θετικοί, για να υπολογιστεί ο ΜΟ)*/
														/* και ο αριθμός διάφορος του 0*/
					printf("\n\tΟ Μ.Ο των θετικών αριθμών είναι: %.3f\n", avg);
				}
				if(pl_th==0)/*αν το πλήθος των θετικών είναι 0, δεν υπάρχει ούτε ένας θτικός*/
					printf("\n\tΔεν δόθηκε κανένας θετικός αριθμός.\n");
					if (pl_art!=0)/*αν το πλήθος των άρτιων είναι διάφορο του 0, υπάρχει τουλάχιστον 1 άρτιος*/
						printf("\n\tΤο πλήθος των άρτιων αριθμών είναι: %d\n", pl_art);
						if(pl_art==0)/*διαφορετικά δεν δόθηκε τέτοιος αριθνμός*/
							printf("\n\tΔεν δόθηκε κανένας άρτιος αριθμός.\n");
	return 0;
}
