#include <stdio.h>/*οδηγία για είσοδο-έξοδο δεδομένων*/

int main(int argc, char **argv)/*βασική συνάρτηση προγράμματος*/
{/*ανοίγει η main*/
    int A, B;/*τυποι μεταβλητών Α,Β*/
    int C, D, E, F; /*τύποι μεταβλητών C,D,E,F*/
    system ("chcp 1253");/*Εμφάνιση ελληνικών χαρακτήρων*/
    printf ("Βασικές αριθμητικές πράξεις με Ακεραίους\n");/*πρώτη γραμμή που θα εμφανιστεί στην οθόνη του χρήστη*/
    printf ("========================================\n\n");
    printf ("Εισάγετε τον πρώτο αριθμό : ");/*ζητάμε τον πρώτο αριθμό*/
    scanf ("%d", &A);/*είδοσος δεδομένων από το πληκτρολόγιο για τον δεύτερο αριθμό*/
    printf ("Εισάγετε το δεύτερο αριθμό: ");/*ζητάμε τον δεύτερο αριθμό*/
    scanf ("%d", &B);/*είδοσος δεδομένων από το πληκτρολόγιο για τον δεύτερο αριθμό*/
    C = A + B;/*η πράξη της πρόσθεσης εκχωρείται στην μεταβλητή C*/
    D = A - B;/*η πράξη της αφαίρεσης εκχωρείται στην μεταβλητή D*/
    E = A * B;/*η πράξη του γινομένου εκχωρείται στην μεταβλητή E*/
    F = A / B;/*η πράξη του πηλίκου εκχωρείται στην μεταβλητή F*/
    
    printf ("Άθροισμα  : %d\n", C); /*Εμφάνιση αθροίσματος*/
    printf ("Διαφορά   : %d\n", D);/*εμφάνιση διαφοράς*/
    printf ("Γινόμενο  : %d\n", E);/*εμφάνιση γινομένου*/
    printf ("Πηλίκο    : %d\n", F);/*εμφάνιση πηλίκου*/
    return 0;/*ομαλή εκτέλεση του προγράμματος*/
}/*κλείνει η main*/

