#include <stdio.h>
int main(int argc, char **argv)
{
	system ("chcp 1253");
	int a, b,c;
	int Max, Max_th;
	printf("Εύρεση Θέσης Μεγαλύτερου Αριθμού \n\n");
	printf("Δώστε τον πρώτο αριθμό: ");
	scanf("%d", &a);
	printf("\nΔώστε τον δεύτερο αριθμό: ");
	scanf("%d", &b);
	printf("\nΔώστε τον τρίτο αριθμό: ");
	scanf("%d", &c);
	Max=a;/*θεωρώ μέγιστο τον πρώτο αριθμό*/
	Max=(b>Max)?b:Max;/*συγκρίνω τον μέγιστο αριθμό που όρισα με τον δεύτερο*/
	Max=(c>Max)?c:Max;/*συγκρίνω τον μέγιστο αριθμό που όρισα με τον τρίτο*/
	
		printf ("\nΟ μεγαλύτερος αριθμός είναι ο %d και εισήχθη" ,Max , Max_th);
		Max_th=a;/*μέγιστη θέση στον πρώτο αριθμό*/
		Max_th=b;/*μέγιστη θέση στον  δεύτερο αριθμό*/
		Max_th=c;/*μέγιστη θέση στον τρίτο αριθμό*/
	
		
	Max_th=(Max>a)?a:printf(" 1ος");/*θεωρώ σαν μέγιστη θέση τη σύγκριση του πρώτου αριθμού με τον μέγιστο, άρα είναι ο πρώτος που ειαήχθη*/

	Max_th=(Max>b)?b:printf(" 2ος");/*θεωρώ σαν μέγιστη θέση τη σύγκριση του δεύτερου αριθμού με τον μέγιστο, άρα είναι ο δεύτερος που ειαήχθη*/
	
	Max_th=(Max>c)?c:printf(" 3ος.");/*θεωρώ σαν μέγιστη θέση τη σύγκριση του τρίτου αριθμού με τον μέγιστο, άρα είναι ο τρίτος που ειαήχθη*/

	return 0;
}
